In [12]:
import pandas as pd

/home/user/.pyenv/versions/3.8.0/lib/python3.8/site-packages/pandas/compat/__init__.py:97: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

# Módulo 6 - Python Avançado

## 1.0 Função Lambda - definição de função
função simples e não replicavél para vários casos

In [6]:
# exemplo
calculation = lambda a, b: a + b

calculation (50,20)

70

# 2.0 Função Map 
aplica uma função em todas as posições de uma  estrutura de dados

In [16]:
#Exemplo 1
nomes = ['PATO', 'Pato', 'Ganso', 'Pato', 'Ganso', 'Pato', 'GANSO']

snakecase = lambda x : x.lower()

list(map(snakecase, nomes))


#Exemplo 2

data = {'nome': ['Rayane', 'Veronica', 'Paulo'],
        'idade': [26,55,54],
         'nascimento': [1994,9946,1947]}

df = pd.DataFrame(data)

age = lambda x: x + ' Oliveira'
df['sobrenome'] = list(map(age, df['nome']))

df

       nome  idade  nascimento          sobrenome
0    Rayane     26        1994    Rayane Oliveira
1  Veronica     55        9946  Veronica Oliveira
2     Paulo     54        1947     Paulo Oliveira

# 3.0 Apply 
Mesma função do Map, mas da biblioteca pandas

In [18]:
df['altura'] = df['idade'].apply(lambda x: x + 100)
df

       nome  idade  nascimento          sobrenome  altura
0    Rayane     26        1994    Rayane Oliveira     126
1  Veronica     55        9946  Veronica Oliveira     155
2     Paulo     54        1947     Paulo Oliveira     154